INSERT INTO genres
(name)
VALUES
('Роман'),
('Рассказ'),
('Биография'),
('Автобиография'),
('Ужасы'),
('Детектив'),
('Триллер'),
('Приключения'),
('Исторический'),
('Фантастика'),
('Фентези'),
('Сказки'),
('Для детей'),
('Бизнес литература'),
('Компьютерные технологии'),
('Религия'),
('Басни'),
('Комедия'),
('Трагедия')

INSERT INTO genres
(name)
VALUES
('Русская литература'),
('Зарубежная литература'),
('Классика')

INSERT INTO authors
(author_id, name, surname, patronymic, date_of_birth)
VALUES
(1,'Николай', 'Васильевич','Гоголь','06-03-1809'),
(2,'Лев', 'Николевич','Толстой','09-09-1828'),
(3,'Стивен','Кинг','','21-09-1947'),
(4,'Иван', 'Сергеевич' ,'Тургенев','9-11-1818'),
(5,'Александр','Сергеевич','Пушкин','6-06-1799')

CREATE TYPE binding AS ENUM ('Твердый','Мягкий','Другой')

alter table books add column
binding binding NOT NULL

INSERT INTO books
VALUES
(user_id, name, date_of_taken, date_of_return, edition_id, binding)


